## Exercise 1

#### Question 1: Display first 5 rows of the dataset

In [1]:
import pandas as pd
data=pd.read_csv('Titanic Dataset-Lec 05 (1).csv')
print(data.head())

   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

#### Question 2: Check for missing values in each column and display the total count

In [3]:
mv=data.isnull().sum()
print(f'Count of missing values:\n{mv}')

Count of missing values:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

#### Question 3: Fill missing values in the "Age" column with the median age

In [5]:
data['Age']=data['Age'].fillna(data['Age'].mean())
ma=data['Age'].isnull().sum()
print(f'Count of missing values in column Age :\n{ma}')

Count of missing values in column Age :
0

#### Question 4: Fill missing values in the "Embarked" column with the most frequent value

In [11]:
mv=data['Embarked'].isnull().sum()
print(mv)

0

In [19]:
if not data['Embarked'].isnull().sum():
    print('There is no missing value in "Embarked" column.')
else:
    data['Embarked'].fillna(data['Embarked'].mode()[0],inplace=True)

There is no missing value in "Embarked" column.

#### Question 5: Convert the "Fare" column to integer data type

In [25]:
print(data['Fare'].dtype) # Display current data type

int32

In [27]:
import numpy as np

# drop NaN values
data=data.dropna(subset='Fare')

if not data['Fare'].dtype == np.int64:
    data['Fare'] = data['Fare'].astype(int)
    print('Now int: ', data['Fare'])
else:
    print('Int')

Now int:  0        7
1        7
2        9
3        8
4       12
      ...
413      8
414    108
415      7
416      8
417     22
Name: Fare, Length: 417, dtype: int32

#### Question 6: Convert the "Sex" column into categorical format using label encoding (Male=1, Female=0)

In [47]:
print(data['Sex'])

0        male
1      female
2        male
3        male
4      female
        ...
413      male
414    female
415      male
416      male
417      male
Name: Sex, Length: 417, dtype: object

In [29]:
data['Sex']=data['Sex'].map({'male':1,'female':0})
print(data['Sex'])

0      1
1      0
2      1
3      1
4      0
      ..
413    1
414    0
415    1
416    1
417    1
Name: Sex, Length: 417, dtype: int64

#### Question 7: Identify and display all duplicate rows in the dataset

In [31]:
dup=data[data.duplicated()]
print(dup)

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

#### Question 8: Remove all duplicate rows from the dataset

In [33]:
dupp=data.drop_duplicates()

#### Question 9: Drop rows where all column values are missing

In [35]:
data=data.dropna(how='all')

#### Question 10: Drop columns with at least one missing value

In [37]:
data=data.dropna(axis=1)

In [39]:
print(data.head())

   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name  Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    1  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)    0  47.0      1      0
2                     Myles, Mr. Thomas Francis    1  62.0      0      0
3                              Wirz, Mr. Albert    1  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)    0  22.0      1      1

    Ticket  Fare Embarked
0   330911     7        Q
1   363272     7        S
2   240276     9        Q
3   315154     8        S
4  3101298    12        S